## Ejercicio pandas 2

In [1]:
import numpy as np
import pandas as pd

/tmp/ipykernel_18439/1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

### Ejercicio 0:
- Carga ambos archivos **`titanic_1.csv`** y **`titanic_2.csv`** y guardalos en **`df1`** y **`df2`** respectivamente:

In [5]:
df1 = pd.read_csv("Data/titanic_1.csv")
df2 = pd.read_csv("Data/titanic_2.csv")

### Ejercicio 1:
- Mostrar las estadisticas de cada uno de los DataFrames.

In [9]:
df1.describe()

       PassengerId         Age
count   891.000000  714.000000
mean    446.000000   29.699118
std     257.353842   14.526497
min       1.000000    0.420000
25%     223.500000   20.125000
50%     446.000000   28.000000
75%     668.500000   38.000000
max     891.000000   80.000000

In [10]:
df2.describe()

       PassengerId    Survived      Pclass        Fare
count   891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   32.204208
std     257.353842    0.486592    0.836071   49.693429
min       1.000000    0.000000    1.000000    0.000000
25%     223.500000    0.000000    2.000000    7.910400
50%     446.000000    0.000000    3.000000   14.454200
75%     668.500000    1.000000    3.000000   31.000000
max     891.000000    1.000000    3.000000  512.329200

### Ejercicio 2:
- Unir los DataFrames para obtener solo uno.

In [11]:
df = pd.merge(left = df1, right = df2, left_on = "PassengerId", right_on = "PassengerId", how = "inner")

df.head(3)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250

### Ejercicio 3:
- Imprimir las últimas 5 filas de las columnas de nombre y edad

In [12]:
df[["Name", "Age"]].head(5)

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

### Ejercicio 4:
- Imprimir las primeras 10 filas de las instancias que en sexo sean igual a femenino.

In [13]:
df[df["Sex"] == "female"].head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,3,350406,7.8542
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,0,3,345763,18.0000

### Ejercicio 5:
- Imprimir las instancias que en la columna **`Fare`** sean menor a 33 y en la columna **`Pclass`** igual a 2.

In [14]:
df_ej5 = df[(df["Fare"] < 33) & (df["Pclass"] == 2)]

df_ej5.head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000
20,21,"Fynney, Mr. Joseph J",male,35.0,0,2,239865,26.0000
21,22,"Beesley, Mr. Lawrence",male,34.0,1,2,248698,13.0000
33,34,"Wheadon, Mr. Edward H",male,66.0,0,2,C.A. 24579,10.5000
41,42,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,0,2,11668,21.0000
53,54,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.0,1,2,2926,26.0000
56,57,"Rugg, Miss. Emily",female,21.0,1,2,C.A. 31026,10.5000
58,59,"West, Miss. Constance Mirium",female,5.0,1,2,C.A. 34651,27.7500

### Ejercicio 6:
- Del resultado anterior obten el número de hombres y el número de mujeres.

In [15]:
df_ej5["Sex"].value_counts(dropna = False)

Sex
male      95
female    68
Name: count, dtype: int64

In [16]:
df_ej5["Sex"].value_counts(dropna = False, normalize = True)

Sex
male      0.582822
female    0.417178
Name: proportion, dtype: float64

### Ejercicio 7:
- Obten el costo total de los tickets de hombres y el costo total de los tickets de mujeres.

In [17]:
df[df["Sex"] == "female"]["Fare"].sum()

13966.6628

In [18]:
df[df["Sex"] == "male"]["Fare"].sum()

14727.286500000002

In [19]:
df.groupby("Sex")["Fare"].sum()

Sex
female    13966.6628
male      14727.2865
Name: Fare, dtype: float64

### Ejercicio 8:
- Obten el costo total de los tickets por cada clase (1, 2 y 3) y el número de pasajeros de cada clase.

In [20]:
# Para la clase 1

print("Total Ticket:", df[df["Pclass"] == 1]["Fare"].sum())
print("Total Pasajeros:", df[df["Pclass"] == 1].shape[0])

Total Ticket: 18177.4125
Total Pasajeros: 216

In [21]:
# Para la clase 2

print("Total Ticket:", df[df["Pclass"] == 2]["Fare"].sum())
print("Total Pasajeros:", df[df["Pclass"] == 2].shape[0])

Total Ticket: 3801.8417
Total Pasajeros: 184

In [22]:
# Para la clase 3

print("Total Ticket:", df[df["Pclass"] == 3]["Fare"].sum())
print("Total Pasajeros:", df[df["Pclass"] == 3].shape[0])

Total Ticket: 6714.6951
Total Pasajeros: 491

In [23]:
df.groupby("Pclass").agg({"Fare" : ["sum", "size"]})

              Fare
               sum size
Pclass
1       18177.4125  216
2        3801.8417  184
3        6714.6951  491

### Ejercicio 9:
- Crear una columna con el apellido de cada pasajero y agregala al DataFrame.

In [24]:
df["Surname"] = df["Name"].apply(lambda x : x.split(",")[0])

df.head(3)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Surname
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500,Braund
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833,Cumings
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,Heikkinen

### Ejercicio 10:
- Encuentra si se repiten apellidos en la columna que se creo en el ejercicio anterior. (Usa .value_counts())

In [25]:
df["Surname"].value_counts()

Surname
Andersson    9
Sage         7
Panula       6
Skoog        6
Carter       6
            ..
Hanna        1
Lewy         1
Mineff       1
Haas         1
Dooley       1
Name: count, Length: 667, dtype: int64

### Ejercicio 11:
- Encuentra los apellidos que se repiten en la columna recien creada. Es decir, solo muestra los apellidos que aparecen más de 1 vez.

In [42]:
len(df[df["Surname"].duplicated()]["Surname"].unique())

133

In [37]:
apellidos = df["Surname"].value_counts()

In [40]:
apellidos

Surname
Andersson    9
Sage         7
Panula       6
Skoog        6
Carter       6
            ..
Hanna        1
Lewy         1
Mineff       1
Haas         1
Dooley       1
Name: count, Length: 667, dtype: int64

In [41]:
pd.DataFrame(apellidos[apellidos > 1])

           count
Surname
Andersson      9
Sage           7
Panula         6
Skoog          6
Carter         6
...          ...
Hocking        2
Kantor         2
Petroff        2
Johnston       2
Dean           2

[133 rows x 1 columns]

### Ejercicio 12:
- Imprime los primeros 10 pasajeros que tengan un **`PassengerID`** multiplo de 3.

In [44]:
df.iloc[range(2, 31, 3), :]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Surname
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,Heikkinen
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583,Moran
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333,Johnson
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500,Bonnell
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,3,350406,7.8542,Vestrom
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000,Williams
20,21,"Fynney, Mr. Joseph J",male,35.0,0,2,239865,26.0000,Fynney
23,24,"Sloper, Mr. William Thompson",male,28.0,1,1,113788,35.5000,Sloper
26,27,"Emir, Mr. Farred Chehab",male,NaN,0,3,2631,7.2250,Emir
29,30,"Todoroff, Mr. Lalio",male,NaN,0,3,349216,7.8958,Todoroff

### Ejercicio 13:
- ¿Cuales son los apellidos de los pasajeros que son mujeres y menores de 20 años?

In [45]:
apellidos_mujeres = df[(df["Sex"] == "female") & (df["Age"] < 20)]["Surname"].to_list()

print(apellidos_mujeres)

['Nasser', 'Sandstrom', 'Vestrom', 'McGowan', 'Palsson', 'Vander Planke', 'Nicola-Yarred', 'Laroche', 'Devaney', 'Arnold-Franchi', 'West', 'Andersson', 'Goodwin', 'Ilett', 'Zabour', 'Attalah', 'Andersson', 'Newsom', 'Ford', 'Gilnagh', 'Johnson', 'Kink-Heilmann', 'Andersen-Jensen', 'Strom', 'Carr', 'Asplund', 'Collyer', 'Bishop', 'Allison', 'Penasco y Castellana', 'Ryerson', 'Hippach', 'Palsson', 'Nakid', 'Lehmann', 'Silven', 'Van Impe', 'Phillips', 'Carter', 'Mellinger', 'Baclini', 'Baclini', 'Hirvonen', 'Maioni', 'Quick', 'Hart', 'Andersson', 'Andersson', 'Beane', 'Taussig', 'Becker', 'Skoog', 'Skoog', 'Baclini', 'Doling', 'Hegarty', 'Turja', 'Madill', 'Karun', 'Astor', 'Barbara', 'Harper', 'Wells', 'Emanuel', 'Ayoub', 'Dick', 'Sjoblom', 'Pettersson', 'Andersson', 'Yasbeck', 'Boulos', 'Lines', 'Aks', 'Najib', 'Graham']

### Ejercicio 14:
- ¿Cuales son los apellidos de los pasajeros que son hombres y mayor de 45 años?

In [46]:
apellidos_hombres = df[(df["Sex"] == "male") & (df["Age"] > 45)]["Surname"].to_list()

print(apellidos_hombres)

['McCarthy', 'Wheadon', 'Ostby', 'Chaffee', 'Coxon', 'Goldschmidt', 'Porter', 'Connors', 'White', 'Bateman', 'Meo', 'Williams', 'Van der hoef', 'Smith', 'Youseff', 'Green', 'Sjostedt', 'Carter', 'Stead', 'Taussig', 'Duane', 'Moraweck', 'Nysveen', 'Partner', 'McKane', 'Widegren', 'Silvey', 'Fortune', 'Peuchen', 'Goldenberg', 'Millet', 'Anderson', 'Gee', 'Milling', 'Smart', 'Rouse', 'Kent', 'Molson', 'Artagaveytia', 'Walker', 'Douglas', 'Nicholson', 'Wright', 'Harris', 'Downton', 'Jarvis', 'Frolicher-Stehli', 'Elsbury', 'Johnson', 'Duff Gordon', 'Sutton', 'Kirkland', 'Barkworth', 'Lundahl', 'Harper', 'Simonius-Blumer', 'Newell', 'Frauenthal', 'Colley', 'Mitchell', 'Brown', 'Weir', 'Chapman', 'Thayer', 'Taylor', 'Greenberg', 'Hodges', 'Crosby', 'Jensen', 'Guggenheim', 'Svensson', 'Daly', 'Vander Cruyssen']

### Ejercicio 15:
- Compara si coinciden los apellidos generados en los ejercicios anteriores.

In [47]:
apellidos_hombres_set = set(apellidos_hombres)

apellidos_mujeres_set = set(apellidos_mujeres)


apellidos_hombres_set.intersection(apellidos_mujeres_set)

{'Carter', 'Harper', 'Johnson', 'Taussig'}

### Ejercicio 16:
- Encuentra los 10 pasajeros que no sobrevivieron más jovenes e imprime cuantos son hombres y cuantos son mujeres.

In [52]:
df[df["Survived"] == 0].sort_values("Age").head(10)["Sex"].value_counts()

Sex
male      5
female    5
Name: count, dtype: int64

### Ejercicio 17:
-  En un DataFrame muestra 3 pasajeros que sean hombres y 3 que sean mujeres, que hayan sobrevivido y para cada clase de la columna Pclass.

In [53]:
df_17 = pd.DataFrame()

for sex in df["Sex"].unique():
    for pclass in df["Pclass"].unique():
        
        df_ = df[(df["Sex"] == sex) & (df["Pclass"] == pclass) & (df["Survived"] == 1)].head(3)
        
        df_17 = pd.concat([df_17, df_], axis = 0, ignore_index = True)
        
df_17

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Surname
0,37,"Mamee, Mr. Hanna",male,NaN,1,3,2677,7.2292,Mamee
1,66,"Moubarek, Master. Gerios",male,NaN,1,3,2661,15.2458,Moubarek
2,75,"Bing, Mr. Lee",male,32.00,1,3,1601,56.4958,Bing
3,24,"Sloper, Mr. William Thompson",male,28.00,1,1,113788,35.5000,Sloper
4,56,"Woolner, Mr. Hugh",male,NaN,1,1,19947,35.5000,Woolner
5,98,"Greenfield, Mr. William Bertram",male,23.00,1,1,PC 17759,63.3583,Greenfield
6,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000,Williams
7,22,"Beesley, Mr. Lawrence",male,34.00,1,2,248698,13.0000,Beesley
8,79,"Caldwell, Master. Alden Gates",male,0.83,1,2,248738,29.0000,Caldwell
9,3,"Heikkinen, Miss. Laina",female,26.00,1,3,STON/O2. 3101282,7.9250,Heikkinen
10,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.00,1,3,347742,11.1333,Johnson
11,11,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,3,PP 9549,16.7000,Sandstrom
12,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,1,PC 17599,71.2833,Cumings
13,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,1,113803,53.1000,Futrelle
14,12,"Bonnell, Miss. Elizabeth",female,58.00,1,1,113783,26.5500,Bonnell
15,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,2,237736,30.0708,Nasser
16,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.00,1,2,248706,16.0000,Hewlett
17,44,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,Laroche

### Ejercicio 18:
- Obtener el tipo de elementos de cada columna y convierte los que sean "int64" a "int32". Evalua la memoria que consume antes y después de convertir las columnas y comenta la diferencia.

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
 4   Survived     891 non-null    int64
 5   Pclass       891 non-null    int64
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
 8   Surname      891 non-null    object
dtypes: float64(2), int64(3), object(4)
memory usage: 62.8+ KB

In [55]:
datos_columnas = df.dtypes.to_dict()

datos_columnas

{'PassengerId': dtype('int64'),
 'Name': dtype('O'),
 'Sex': dtype('O'),
 'Age': dtype('float64'),
 'Survived': dtype('int64'),
 'Pclass': dtype('int64'),
 'Ticket': dtype('O'),
 'Fare': dtype('float64'),
 'Surname': dtype('O')}

In [56]:
for llave, valor in datos_columnas.items():
    if valor == "int64":
        df[llave] = df[llave].astype("int32")

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int32
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
 4   Survived     891 non-null    int32
 5   Pclass       891 non-null    int32
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
 8   Surname      891 non-null    object
dtypes: float64(2), int32(3), object(4)
memory usage: 52.3+ KB

### Ejercicio 19:
- Encuentra a los pasajeros de la clase 1 y 3 entre 20 y 25 años y comprueba si son más hombres o mujeres.

In [58]:
df[(df["Pclass"].isin([1, 3])) & (df["Age"].between(20, 25))]["Sex"].value_counts()

Sex
male      73
female    34
Name: count, dtype: int64

### Ejercicio 20:
- Agrega una nueva columna al DataFrame que se llame: "Rango edad" y va a categorizar de la siguiente manera:
    - Niño < 11 años
    - Joven < 18 años
    - Adulto < 50 años
    - Mayor >= 50 años

In [59]:
def rango_edad(edad):
    
    if edad < 11:
        return "niño"
    elif edad < 18:
        return "joven"
    elif edad < 50:
        return "adulto"
    else:
        return "mayor"

In [60]:
df["rango_edad"] = df["Age"].apply(lambda x : rango_edad(x))

df.head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Surname,rango_edad
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500,Braund,adulto
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833,Cumings,adulto
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,Heikkinen,adulto
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000,Futrelle,adulto
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500,Allen,adulto
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583,Moran,mayor
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,1,17463,51.8625,McCarthy,mayor
7,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750,Palsson,niño
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333,Johnson,adulto
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708,Nasser,joven

### Ejercicio 21:
- Encontrar a los pasajeros "jovenes" y "mayores" de la clase 2 y 3 que hayan sobrevivido. Imprimir los 10 primeros.

In [ ]:
df[(df["rango_edad"].isin(["joven", "mayor"])) & (df["Pclass"].isin([2, 3]))]

### Ejercicio 22:
- Encuentra la edad promedio de todos los pasajeros y reemmplazala por los NaN en la columna de Age y ejecuta el ejercicio anterior.

In [ ]:
edad_promedio = df["Age"].mean()

edad_promedio

In [ ]:
df["Age"].fillna(edad_promedio, inplace = True)

df.head(10)

### Ejercicio 23:
- Cambia a español la columna **`Sex`**.

In [ ]:
df["Sex"].replace({"male" : "hombre", "female" : "mujer"}, inplace = True)


df["Sex"].unique()

### Ejercicio 24:
- Convierte a mayusculas todas las columnas que los valores sean cadenas.

In [ ]:
datos_columnas = df.dtypes.to_dict()

datos_columnas

In [ ]:
for llave, valor in datos_columnas.items():
    if valor == "object":
        df[llave] = df[llave].apply(lambda x : x.upper())
        
        
df.head()

### Ejercicio 25:
- Agrupa por sexo y rango de edad y encuentra la edad promedio.

In [ ]:
df.groupby(["Sex", "rango_edad"]).agg({"Age" : ["mean"]})

### Ejercicio 26:
- Divide la columna name en las siguientes columnas:
    - Mrs/Miss
    - Apellido
    - Nombre(s)
    
**Nota: Ignora el resto de información.**

In [ ]:
df["Mrs/Mss"] = df["Name"].apply(lambda x : x.split(",")[1].split()[0])

df.head(3)

In [ ]:
df["Apellido"] = df["Name"].apply(lambda x : x.split(",")[0])

df.head(3)

In [ ]:
df["Nombre"] = df["Name"].apply(lambda x : " ".join(x.split(",")[1].split()[1:]))

df.head(3)